spec/cassettes/isb___daptor/provide___ublication/with_valid_arguments_post_publication_raises_no_error_with_single_topic_string.yml

--- 
http_interactions: 
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:CreateChannel><ChannelURI>Test1354235667</ChannelURI><ChannelType>Publication</ChannelType></ins0:CreateChannel></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=r20zfiptcopg14msxv2df1ze
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/CreateChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "498"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "260"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:41 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><CreateChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:28 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:OpenPublicationSession><ChannelURI>Test1354235667</ChannelURI></ins0:OpenPublicationSession></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/OpenPublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "478"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "360"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:42 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><OpenPublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"><SessionID>ee660988-8f4f-4a7c-b52e-ad29fa5cb884</SessionID></OpenPublicationSessionResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:29 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:PostPublication><SessionID>ee660988-8f4f-4a7c-b52e-ad29fa5cb884</SessionID><MessageContent><test/></MessageContent><Topic>topic</Topic><Expiry></Expiry></ins0:PostPublication></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/PostPublication\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "561"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "346"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:43 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><PostPublicationResponse xmlns="http://www.openoandm.org/xml/ISBM/"><MessageID>9b6b1fb3-1540-48c6-9ad3-fc1de4538b49</MessageID></PostPublicationResponse></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:30 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ProviderPublicationService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:ClosePublicationSession><SessionID>ee660988-8f4f-4a7c-b52e-ad29fa5cb884</SessionID></ins0:ClosePublicationSession></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=qm21qsfrtroq55hf5d5lgjm2
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/ClosePublicationSession\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "500"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "270"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:45 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><ClosePublicationSessionResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:31 GMT
  - request: 
      method: post
      uri: http://simpleisbm.assetricity.com/ChannelManagementService
      body: 
        string: <?xml version="1.0" encoding="UTF-8"?><env:Envelope xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:isbm="http://www.openoandm.org/xml/ISBM/" xmlns:env="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ins0="http://www.openoandm.org/xml/ISBM/" xmlns="http://www.openoandm.org/xml/ISBM/"><env:Body><ins0:DeleteChannel><ChannelURI>Test1354235667</ChannelURI></ins0:DeleteChannel></env:Body></env:Envelope>
      headers: 
        cookie: 
          - ASP.NET_SessionId=r20zfiptcopg14msxv2df1ze
        soapaction: 
          - "\"http://www.openoandm.org/xml/ISBM/DeleteChannel\""
        content-type: 
          - text/xml;charset=UTF-8
        content-length: 
          - "460"
        accept: 
          - "*/*"
    response: 
      status: 
        code: 200
        message: OK
      headers: 
        cache-control: 
          - private
        content-length: 
          - "260"
        content-type: 
          - text/xml; charset=utf-8
        server: 
          - Microsoft-IIS/7.5
        x-aspnet-version: 
          - 4.0.30319
        x-powered-by: 
          - ASP.NET
        date: 
          - Fri, 30 Nov 2012 00:34:46 GMT
      body: 
        string: <s:Envelope xmlns:s="http://schemas.xmlsoap.org/soap/envelope/"><s:Body xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema"><DeleteChannelResponse xmlns="http://www.openoandm.org/xml/ISBM/"/></s:Body></s:Envelope>
      http_version: "1.1"
    recorded_at: Fri, 30 Nov 2012 00:34:32 GMT
recorded_with: VCR 2.2.5
